{
  "2.5.0": {
    "en": "Added: Energy price optimization flow cards with 4 capabilities (cheapest block start time, 24h/4h price forecasts, daily savings potential), 3 triggers (cheapest block started, expensive block approaching, price trend changed), and 3 conditions (price in cheapest hours, price trend analysis, price vs daily average). Fixed: All price capabilities and flow cards now display effective prices based on price_calculation_mode setting (market/market+/all-in) instead of raw market prices. Price trend detection uses linear regression analysis.",
    "nl": "Toegevoegd: Energieprijs optimalisatie flow cards met 4 capabilities (goedkoopste blok starttijd, 24u/4u prijsvoorspellingen, dagelijks besparingspotentieel), 3 triggers (goedkoopste blok gestart, duur blok nadert, prijstrend veranderd), en 3 conditions (prijs in goedkoopste uren, prijstrend analyse, prijs vs daggemiddelde). Opgelost: Alle prijs capabilities en flow cards tonen nu effectieve prijzen gebaseerd op price_calculation_mode instelling (marktprijs/marktprijs+/all-in) in plaats van ruwe marktprijzen. Prijstrenddetectie gebruikt lineaire regressie analyse.",
    "de": "Hinzugefügt: Energiepreis-Optimierungs-Flow-Karten mit 4 Capabilities (günstigster Block-Startzeit, 24h/4h-Preisprognosen, tägliches Einsparpotenzial), 3 Triggern (günstigster Block gestartet, teurer Block nähert sich, Preistrend geändert) und 3 Bedingungen (Preis in günstigsten Stunden, Preistrend-Analyse, Preis vs Tagesdurchschnitt). Behoben: Alle Preis-Capabilities und Flow-Karten zeigen jetzt effektive Preise basierend auf price_calculation_mode-Einstellung (Markt/Markt+/All-in) anstelle von Roh-Marktpreisen. Preistrend-Erkennung nutzt lineare Regressionsanalyse.",
    "fr": "Ajouté: Cartes de flux d'optimisation des prix d'énergie avec 4 capacités (heure de début du bloc le moins cher, prévisions de prix 24h/4h, potentiel d'économies quotidiennes), 3 déclencheurs (bloc le moins cher commencé, bloc cher approche, tendance des prix changée) et 3 conditions (prix dans les heures les moins chères, analyse de tendance des prix, prix vs moyenne quotidienne). Corrigé: Toutes les capacités de prix et cartes de flux affichent maintenant les prix effectifs basés sur le paramètre price_calculation_mode (marché/marché+/all-in) au lieu des prix de marché bruts. Détection de tendance des prix utilise analyse de régression linéaire."
  },
  "2.4.15": {
    "en": "Fixed: Adaptive control flow card triggers now fire correctly (temperature_adjustment_recommended, adaptive_status_change). Added building_model_diagnostics capability tracking building thermal model learning with tau/C/UA parameters, confidence, and recommendations. Diagnose building model action now updates capability and logs detailed status.",
    "nl": "Opgelost: Adaptieve controle flow card triggers worden nu correct geactiveerd (temperature_adjustment_recommended, adaptive_status_change). Building_model_diagnostics capability toegevoegd die gebouwmodel leren volgt met tau/C/UA parameters, betrouwbaarheid en aanbevelingen. Diagnosticeer gebouwmodel actie update nu capability en logt gedetailleerde status.",
    "de": "Behoben: Adaptive Steuerungs-Flow-Card-Trigger werden jetzt korrekt ausgelöst (temperature_adjustment_recommended, adaptive_status_change). Building_model_diagnostics Capability hinzugefügt, die Gebäudemodell-Lernen mit tau/C/UA-Parametern, Vertrauen und Empfehlungen verfolgt. Gebäudemodell diagnostizieren Aktion aktualisiert jetzt Capability und protokolliert detaillierten Status.",
    "fr": "Corrigé: Les déclencheurs de carte de flux de contrôle adaptatif se déclenchent maintenant correctement (temperature_adjustment_recommended, adaptive_status_change). Ajout de la capacité building_model_diagnostics qui suit l'apprentissage du modèle thermique avec paramètres tau/C/UA, confiance et recommandations. L'action diagnostiquer modèle de bâtiment met maintenant à jour la capacité et enregistre l'état détaillé."
  },
  "2.4.13": {
    "en": "Custom heating curve flow card now uses Adlar L28/L29 parameters. Enter slope grade per 10°C (L28) directly without manual conversion. IP address setting clarified as 'Local IP Address' with warning against public IPs.",
    "nl": "Custom stooklijn flow card gebruikt nu Adlar L28/L29 parameters. Voer hellingsgraad per 10°C (L28) direct in zonder handmatige conversie. IP-adres instelling verduidelijkt als 'Lokaal IP-adres' met waarschuwing tegen publieke IPs.",
    "de": "Custom Heizkurve Flow-Karte verwendet jetzt Adlar L28/L29 Parameter. Neigungsgrad pro 10°C (L28) direkt eingeben ohne manuelle Umrechnung. IP-Adresse Einstellung als 'Lokale IP-Adresse' klargestellt mit Warnung vor öffentlichen IPs.",
    "fr": "Carte de flux courbe de chauffage Custom utilise maintenant paramètres Adlar L28/L29. Entrez pente par 10°C (L28) directement sans conversion manuelle. Paramètre adresse IP clarifié comme 'Adresse IP locale' avec avertissement contre IPs publiques."
  },
  "2.4.12": {
    "en": "Adaptive control now starts automatically on app restart when enabled in settings. Diagnostic capability shows weighted decision breakdown (comfort/efficiency/cost components) with PI controller status.",
    "nl": "Adaptieve controle start nu automatisch bij app herstart wanneer ingeschakeld in instellingen. Diagnostische capability toont gewogen beslissing uitsplitsing (comfort/efficiëntie/kosten componenten) met PI controller status.",
    "de": "Adaptive Steuerung startet jetzt automatisch bei App-Neustart wenn in Einstellungen aktiviert. Diagnose-Capability zeigt gewichtete Entscheidungsaufschlüsselung (Komfort/Effizienz/Kosten-Komponenten) mit PI-Controller-Status.",
    "fr": "Contrôle adaptatif démarre automatiquement au redémarrage de l'application quand activé dans paramètres. Capacité diagnostic affiche répartition décision pondérée (composants confort/efficacité/coût) avec statut contrôleur PI."
  },
  "2.4.6": {
    "en": "Energy optimizer now works with Market price, Market price+, and All-in prices.",
    "nl": "De energy optimizer werkt nu met zowel Marktprijs, Marktprijs+ en All-in prijzen.",
    "de": "Energieoptimierung funktioniert jetzt mit Marktpreis, Marktpreis+ und All-in-Preisen.",
    "fr": "L'optimiseur d'énergie fonctionne maintenant avec prix Marché, Marché+ et Tout compris."
  },
  "2.4.4": {
    "en": "Fixed: Energy price capability updates no longer crash when price data unavailable. Improved null-safety and error handling in adaptive control. Renamed defrost capability to 'Defrost Power Consumption' for clarity.",
    "nl": "Opgelost: Energieprijs capability updates crashen niet meer wanneer prijsdata niet beschikbaar is. Verbeterde null-veiligheid en foutafhandeling in adaptieve regeling. Defrost capability hernoemd naar 'Ontdooistand Vermogensverbruik' voor duidelijkheid.",
    "de": "Behoben: Energiepreis-Capability-Updates stürzen nicht meer ab wenn Preisdaten nicht verfügbar. Verbesserte Null-Sicherheit und Fehlerbehandlung in adaptiver Steuerung. Abtau-Capability umbenannt in 'Abtau-Leistungsaufnahme' für Klarheit.",
    "fr": "Corrigé: Les mises à jour de capacité de prix d'énergie ne plantent plus quand données de prix indisponibles. Sécurité nulle et gestion d'erreurs améliorées dans contrôle adaptatif. Capacité dégivrage renommée en 'Consommation pendant dégivrage' pour clarté."
  },
  "2.4.2": {
    "en": "Fixed: Priority settings (Comfort/Efficiency/Cost) in adaptive control now work as intended. Settings were visible in UI but ignored (always used 60%/25%/15%). Users can now configure any combination (e.g., 0% comfort, 100% efficiency for COP-only optimization).",
    "nl": "Opgelost: Prioriteitsinstellingen (Comfort/Efficiëntie/Kosten) in adaptieve regeling werken nu zoals bedoeld. Instellingen waren zichtbaar in UI maar werden genegeerd (gebruikte altijd 60%/25%/15%). Gebruikers kunnen nu elke combinatie instellen (bijv. 0% comfort, 100% efficiëntie voor alleen-COP optimalisatie).",
    "de": "Behoben: Prioritätseinstellungen (Komfort/Effizienz/Kosten) in adaptiver Steuerung funktionieren jetzt wie vorgesehen. Einstellungen waren in UI sichtbar, wurden aber ignoriert (verwendete immer 60%/25%/15%). Benutzer können jetzt jede Kombination konfigurieren (z.B. 0% Komfort, 100% Effizienz für reine COP-Optimierung).",
    "fr": "Corrigé: Les paramètres de priorité (Confort/Efficacité/Coût) dans le contrôle adaptatif fonctionnent maintenant comme prévu. Les paramètres étaient visibles dans l'UI mais ignorés (utilisait toujours 60%/25%/15%). Les utilisateurs peuvent maintenant configurer n'importe quelle combinaison (par ex. 0% confort, 100% efficacité pour optimisation COP uniquement)."
  },
  "2.4.0": {
    "en": "Added: Defrost power monitoring capability tracks power consumption during defrost cycles. Heating curve visualization capabilities display formula, slope, intercept, and reference points. All 6 new capabilities automatically added to existing devices.",
    "nl": "Toegevoegd: Defrost vermogen monitoring capability volgt stroomverbruik tijdens ontdooicycli. Verwarmingscurve visualisatie capabilities tonen formule, helling, snijpunt en referentiepunten. Alle 6 nieuwe capabilities automatisch toegevoegd aan bestaande apparaten.",
    "de": "Hinzugefügt: Abtau-Leistungsüberwachungs-Capability verfolgt Stromverbrauch während Abtauzyklen. Heizkurven-Visualisierungs-Capabilities zeigen Formel, Steigung, Schnittpunkt und Referenzpunkte. Alle 6 neuen Capabilities automatisch zu bestehenden Geräten hinzugefügt.",
    "fr": "Ajouté: Capacité de surveillance de puissance de dégivrage suit la consommation d'énergie pendant les cycles de dégivrage. Capacités de visualisation de courbe de chauffage affichent formule, pente, ordonnée à l'origine et points de référence. Toutes les 6 nouvelles capacités automatiquement ajoutées aux appareils existants."
  },
  "2.3.6": {
    "en": "Fixed: All energy-related SVG icons now display correctly on iPhone. Icons optimized for iOS WebKit rendering (removed text elements, standardized stroke widths, added theme-aware colors).",
    "nl": "Opgelost: Alle energie-gerelateerde SVG iconen worden nu correct weergegeven op iPhone. Iconen geoptimaliseerd voor iOS WebKit rendering (tekstelementen verwijderd, stroke breedte gestandaardiseerd, theme-aware kleuren toegevoegd).",
    "de": "Behoben: Alle energiebezogenen SVG-Icons werden jetzt korrekt auf iPhone angezeigt. Icons für iOS WebKit-Rendering optimiert (Textelemente entfernt, Strichbreiten standardisiert, theme-aware Farben hinzugefügt).",
    "fr": "Corrigé: Toutes les icônes SVG liées à l'énergie s'affichent maintenant correctement sur iPhone. Icônes optimisées pour le rendu iOS WebKit (éléments de texte supprimés, largeurs de trait standardisées, couleurs sensibles au thème ajoutées)."
  },
  "2.3.5": {
    "en": "CRITICAL FIX: Adaptive control now uses correct desired room temperature instead of heat pump water setpoint. New subcapabilities target_temperature.indoor (user-settable comfort temperature) and measure_temperature.indoor (actual room temperature from external sensors) replace legacy adlar_external_indoor_temperature. Fixes nonsensical error calculations (was comparing 45°C water temp to 21°C room temp).",
    "nl": "KRITIEKE FIX: Adaptieve regeling gebruikt nu correcte gewenste kamertemperatuur in plaats van warmtepomp water setpoint. Nieuwe subcapabilities target_temperature.indoor (instelbare comfort temperatuur) en measure_temperature.indoor (werkelijke kamertemperatuur van externe sensoren) vervangen verouderde adlar_external_indoor_temperature. Lost onzinnige foutberekeningen op (vergeleek 45°C water temp met 21°C kamer temp).",
    "de": "KRITISCHER FIX: Adaptive Steuerung verwendet jetzt korrekte gewünschte Raumtemperatur statt Wärmepumpen-Wasser-Sollwert. Neue Subcapabilities target_temperature.indoor (einstellbare Komforttemperatur) und measure_temperature.indoor (tatsächliche Raumtemperatur von externen Sensoren) ersetzen veraltete adlar_external_indoor_temperature. Behebt unsinnige Fehlerberechnungen (verglich 45°C Wassertemp mit 21°C Raumtemp).",
    "fr": "CORRECTIF CRITIQUE: Le contrôle adaptatif utilise maintenant la température ambiante souhaitée correcte au lieu de la consigne d'eau de la pompe à chaleur. Nouvelles subcapabilities target_temperature.indoor (température de confort réglable) et measure_temperature.indoor (température ambiante réelle des capteurs externes) remplacent l'ancienne adlar_external_indoor_temperature. Corrige calculs d'erreur absurdes (comparait 45°C temp eau avec 21°C temp pièce)."
  },
  "2.3.0": {
    "en": "Changed: State flow cards now use Homey's built-in capability triggers. Defrost, compressor, and backwater states show as 'turned on/off' instead of custom cards.",
    "nl": "Gewijzigd: Status flow cards gebruiken nu Homey's ingebouwde capability triggers. Defrost, compressor en terugwater statussen tonen als 'ingeschakeld/uitgeschakeld' in plaats van custom cards.",
    "de": "Geändert: Zustands-Flow-Karten verwenden jetzt Homeys eingebaute Capability-Trigger. Abtau-, Kompressor- und Rückwasserzustände werden als 'eingeschaltet/ausgeschaltet' angezeigt statt custom Karten.",
    "fr": "Modifié: Les cartes de flux d'état utilisent maintenant les déclencheurs de capacité intégrés de Homey. Les états dégivrage, compresseur et eau de retour s'affichent comme 'activé/désactivé' au lieu de cartes personnalisées."
  },
  "2.2.0": {
    "en": "Added: Building type profiles (light/average/heavy/passive) set starting values for faster thermal model learning. Time-of-day internal gains (night 40%, day 100%, evening 180%). Seasonal solar gain adjustment accounts for sun angle (winter 60%, summer 130%).",
    "nl": "Toegevoegd: Gebouwtype profielen (licht/gemiddeld/zwaar/passief) stellen startwaarden in voor sneller thermisch model leren. Tijdsafhankelijke interne warmtewinsten (nacht 40%, dag 100%, avond 180%). Seizoensgebonden zonnewinst aanpassing houdt rekening met zonnehoek (winter 60%, zomer 130%).",
    "de": "Hinzugefügt: Gebäudetyp-Profile (leicht/durchschnitt/schwer/passiv) setzen Startwerte für schnelleres thermisches Modell-Lernen. Zeitabhängige interne Gewinne (Nacht 40%, Tag 100%, Abend 180%). Saisonale Solargewinn-Anpassung berücksichtigt Sonnenwinkel (Winter 60%, Sommer 130%).",
    "fr": "Ajouté: Profils de type de bâtiment (léger/moyen/lourd/passif) définissent valeurs départ pour apprentissage modèle thermique rapide. Gains internes selon heure (nuit 40%, jour 100%, soir 180%). Ajustement saisonnier du gain solaire tient compte angle soleil (hiver 60%, été 130%)."
  },
  "2.1.0": {
    "en": "Added: Calculate linear heating curve flow card for weather-compensated heating. Calculates supply temperature based on outdoor temperature, reference point, and slope coefficient (e.g., 55°C at -15°C with slope -0.5).",
    "nl": "Toegevoegd: Bereken lineaire verwarmingscurve flow card voor weerafhankelijke verwarming. Berekent aanvoertemperatuur op basis van buitentemperatuur, referentiepunt en hellingscoëfficiënt (bijv. 55°C bij -15°C met helling -0.5).",
    "de": "Hinzugefügt: Lineare Heizkurve berechnen Flow-Karte für wettergeführte Heizung. Berechnet Vorlauftemperatur basierend auf Außentemperatur, Referenzpunkt und Neigungskoeffizient (z.B. 55°C bei -15°C mit Neigung -0.5).",
    "fr": "Ajouté: Carte de flux calculer courbe de chauffage linéaire pour chauffage compensé par météo. Calcule température de départ basée sur température extérieure, point de référence et coefficient de pente (par ex. 55°C à -15°C avec pente -0.5)."
  },
  "2.0.7": {
    "en": "Added: Configurable log level in device settings (ERROR/WARN/INFO/DEBUG). Reduces log noise in production - set to ERROR to see only critical failures.",
    "nl": "Toegevoegd: Instelbaar log niveau in apparaat instellingen (ERROR/WARN/INFO/DEBUG). Vermindert log ruis in productie - zet op ERROR om alleen kritieke fouten te zien.",
    "de": "Hinzugefügt: Konfigurierbares Log-Level in Geräteeinstellungen (ERROR/WARN/INFO/DEBUG). Reduziert Log-Rauschen in Produktion - auf ERROR setzen um nur kritische Fehler zu sehen.",
    "fr": "Ajouté: Niveau de journal configurable dans les paramètres de l'appareil (ERROR/WARN/INFO/DEBUG). Réduit le bruit des journaux en production - définir sur ERROR pour voir uniquement les échecs critiques."
  },
  "2.0.6": {
    "en": "Fixed: State change flow cards (defrost, compressor, backwater) now trigger correctly. Error messages in logs now show emoji indicators (🧊 defrost, ⚙️ compressor, 💧 backwater, ❌ errors).",
    "nl": "Opgelost: Status wijziging flow cards (defrost, compressor, backwater) triggeren nu correct. Foutmeldingen in logs tonen nu emoji indicatoren (🧊 defrost, ⚙️ compressor, 💧 backwater, ❌ fouten).",
    "de": "Behoben: Zustandsänderungs-Flow-Karten (Abtauung, Kompressor, Rückwasser) werden jetzt korrekt ausgelöst. Fehlermeldungen in Protokollen zeigen jetzt Emoji-Indikatoren (🧊 Abtauung, ⚙️ Kompressor, 💧 Rückwasser, ❌ Fehler).",
    "fr": "Corrigé: Les cartes de flux de changement d'état (dégivrage, compresseur, eau de retour) se déclenchent maintenant correctement. Les messages d'erreur dans les journaux affichent maintenant des indicateurs emoji (🧊 dégivrage, ⚙️ compresseur, 💧 eau de retour, ❌ erreurs)."
  },
  "2.0.5": {
    "en": "Added: Building model capabilities (C/UA/tau/g/pInt) are now added to existing devices.",
    "nl": "Toegevoegd: Building model capabilities (C/UA/tau/g/pInt) worden nu toegevoegd aan bestaande apparaten. ",
    "de": "Hinzugefügt: Gebäudemodell-Capabilities (C/UA/tau/g/pInt) werden jetzt zu bestehenden Geräten hinzugefügt.",
    "fr": "Ajouté: Les capacités du modèle de bâtiment (C/UA/tau/g/pInt) sont maintenant ajoutées aux appareils existants."
  },
  "2.0.2": {
    "en": "Connection status updates reduced to 30-second intervals (was 5 seconds). Outdoor temperature now uses external sensor when available, falls back to heat pump sensor (improves thermal mass learning accuracy).",
    "nl": "Verbindingsstatus updates verlaagd naar 30 seconden interval (was 5 seconden). Buitentemperatuur gebruikt nu externe sensor indien beschikbaar, valt terug op warmtepomp sensor (verbetert thermische massa leer-nauwkeurigheid).",
    "de": "Verbindungsstatus-Updates auf 30-Sekunden-Intervalle reduziert (war 5 Sekunden). Außentemperatur verwendet jetzt externen Sensor wenn verfügbar, fällt zurück auf Wärmepumpen-Sensor (verbessert Genauigkeit des Thermische-Masse-Lernens).",
    "fr": "Mises à jour statut connexion réduites à intervalles 30 secondes (était 5 secondes). Température extérieure utilise capteur externe si disponible, sinon capteur pompe à chaleur (améliore précision apprentissage masse thermique)."
  },
  "2.0.1": {
    "en": "Fixed: Indoor temperature flow card now works (registration handler added). Added: Building model diagnostic tool to troubleshoot tau/C/UA learning issues.",
    "nl": "Opgelost: Binnentemperatuur flow card werkt nu (registratie handler toegevoegd). Toegevoegd: Gebouwmodel diagnostische tool om tau/C/UA leer-problemen op te lossen.",
    "de": "Behoben: Raumtemperatur-Flow-Karte funktioniert jetzt (Registrierungs-Handler hinzugefügt). Hinzugefügt: Gebäudemodell-Diagnosetool zur Fehlerbehebung bei tau/C/UA-Lernproblemen.",
    "fr": "Corrigé: La carte de flux de température intérieure fonctionne maintenant (gestionnaire d'enregistrement ajouté). Ajouté: Outil de diagnostic du modèle de bâtiment pour résoudre les problèmes d'apprentissage tau/C/UA."
  },
  "2.0.0": {
    "en": "Added: Alpha version of Adaptive temperature control with PI regulation, thermal predictions, energy price optimization, and COP optimization.",
    "nl": "Toegevoegd: Alfa versie van Adaptieve temperatuurregeling met PI-regeling, thermische voorspellingen, energieprijsoptimalisatie en COP-optimalisatie.",
    "de": "Hinzugefügt: Alpha-Version von Adaptiver Temperaturregelung mit PI-Regelung, thermischen Vorhersagen, Energiepreis-Optimierung und COP-Optimierung.",
    "fr": "Ajouté: Version alpha de régulation Adaptative de température avec régulation PI, prédictions thermiques, optimisation du prix de l'énergie et optimisation du COP."
  },
  "1.3.13": {
    "en": "Fixed: Trigger card titles now correctly indicate change events in all languages (11 triggers updated). State triggers show 'changed to', mode triggers show 'changed to', COP/temperature triggers show 'changed'. Prevents confusion between triggers (edge-triggered) and conditions (level-triggered).",
    "nl": "Opgelost: Trigger card titels tonen nu correct wijzigingsgebeurtenissen in alle talen (11 triggers bijgewerkt). Status triggers tonen 'gewijzigd naar', modus triggers tonen 'gewijzigd naar', COP/temperatuur triggers tonen 'gewijzigd'. Voorkomt verwarring tussen triggers (edge-triggered) en conditions (level-triggered).",
    "de": "Behoben: Trigger-Kartentitel zeigen jetzt korrekt Änderungsereignisse in allen Sprachen (11 Trigger aktualisiert). Zustandstrigger zeigen 'zu ... geändert', Modustrigger zeigen 'zu ... geändert', COP/Temperatur-Trigger zeigen 'geändert'. Verhindert Verwechslung zwischen Triggern (flankengetriggert) und Bedingungen (pegelgetriggert).",
    "fr": "Corrigé: Les titres des cartes de déclenchement indiquent maintenant correctement les événements de changement dans toutes les langues (11 déclencheurs mis à jour). Les déclencheurs d'état affichent 'changé à', les déclencheurs de mode affichent 'changé à', les déclencheurs COP/température affichent 'changé'. Évite la confusion entre déclencheurs (déclenchés par flanc) et conditions (déclenchées par niveau)."
  },
  "1.3.12": {
    "en": "Fixed: Temperature triggers now execute whenever temperature meets threshold. Added: Expert mode flow cards (compressor frequency, fan motor frequency, water flow alerts) with threshold monitoring. Both improvements prevent missed alerts when values remain in alarm zone.",
    "nl": "Opgelost: Temperatuur triggers voeren nu uit wanneer temperatuur aan drempel voldoet. Toegevoegd: Expert modus flow cards (compressor frequentie, ventilator motor frequentie, water doorstroom alarmen) met drempel monitoring. Beide verbeteringen voorkomen gemiste alarmen wanneer waarden in alarm zone blijven.",
    "de": "Behoben: Temperatur-Trigger werden jetzt ausgeführt, wenn die Temperatur den Schwellenwert erfüllt. Hinzugefügt: Experten-Modus Flow-Karten (Kompressor-Frequenz, Lüftermotor-Frequenz, Wasserdurchfluss-Alarme) mit Schwellenwert-Überwachung. Beide Verbesserungen verhindern verpasste Alarme, wenn Werte in der Alarmzone bleiben.",
    "fr": "Corrigé: Les déclencheurs de température s'exécutent maintenant lorsque la température atteint le seuil. Ajouté: Cartes de flux en mode expert (fréquence du compresseur, fréquence du moteur de ventilateur, alertes de débit d'eau) avec surveillance de seuil. Les deux améliorations empêchent les alertes manquées lorsque les valeurs restent dans la zone d'alarme."
  },
  "1.3.11": {
    "en": "Connection timeout increased from 10 to 20 seconds for poor WiFi conditions. Device commands now wait for ongoing queries to complete, preventing connection interruptions.",
    "nl": "Verbindingstimeout verhoogd van 10 naar 20 seconden voor zwakke WiFi. Apparaatcommando's wachten nu tot lopende queries compleet zijn, voorkomt verbrekingen.",
    "de": "Verbindungs-Timeout von 10 auf 20 Sekunden für schlechte WLAN-Bedingungen erhöht. Gerätebefehle warten jetzt auf laufende Abfragen, verhindert Verbindungsunterbrechungen.",
    "fr": "Délai de connexion augmenté de 10 à 20 secondes pour les conditions WiFi faibles. Les commandes d'appareil attendent maintenant la fin des requêtes en cours, évitant les interruptions de connexion."
  },
  "1.3.10": {
    "en": "Calculate Value from Curve now accepts token expressions (e.g., {{ outdoor_temperature }}) and calculated values (e.g., {{ 10 - 5 }}) in the input field. German and French language support added.",
    "nl": "Bereken Waarde uit Curve accepteert nu token expressies (bijv. {{ buitentemperatuur }}) en berekende waarden (bijv. {{ 10 - 5 }}) in het invoerveld. Duitse en Franse taalondersteuning toegevoegd.",
    "de": "Wert aus Kurvenreg1.3.11eln berechnen akzeptiert jetzt Token-Ausdrücke (z.B. {{ Außentemperatur }}) und berechnete Werte (z.B. {{ 10 - 5 }}) im Eingabefeld. Deutsche und französische Sprachunterstützung hinzugefügt.",
    "fr": "Calculer une valeur à partir de règles de courbe accepte maintenant des expressions de jeton (par ex. {{ température_extérieure }}) et des valeurs calculées (par ex. {{ 10 - 5 }}) dans le champ d'entrée. Prise en charge des langues allemande et française ajoutée."
  },
  "1.3.9": {
    "en": "CRITICAL FIX: Resolved zombie connection crash caused by flow card runListener errors. Added comprehensive error handling to all 9 changed triggers (temperature, COP, state). Added R290 and R32 heat pump technical specifications.",
    "nl": "KRITIEKE FIX: Zombie verbindingscrash opgelost veroorzaakt door flow card runListener fouten. Uitgebreide foutafhandeling toegevoegd aan alle 9 gewijzigde triggers (temperatuur, COP, status). Technische specificaties voor R290 en R32 warmtepompen toegevoegd.",
    "de": "KRITISCHER FIX: Zombie-Verbindungsabsturz behoben, verursacht durch Flow-Card-runListener-Fehler. Umfassende Fehlerbehandlung zu allen 9 geänderten Triggern hinzugefügt (Temperatur, COP, Status). Technische Spezifikationen für R290- und R32-Wärmepumpen hinzugefügt.",
    "fr": "CORRECTIF CRITIQUE: Crash de connexion zombie résolu causé par des erreurs de runListener de carte de flux. Gestion d'erreurs complète ajoutée à tous les 9 déclencheurs modifiés (température, COP, état). Spécifications techniques des pompes à chaleur R290 et R32 ajoutées."
  },
  "1.3.3": {
    "en": "Improved flow card tokens: Temperature change triggers (ambient, inlet, outlet) now show only current temperature. COP efficiency trigger shows performance trend with previous value and change amount (e.g., 3.0 → 3.2, +0.2).",
    "nl": "Verbeterde flow card tokens: Temperatuur wijziging triggers (omgeving, inlaat, uitlaat) tonen nu alleen huidige temperatuur. COP efficiëntie trigger toont prestatie trend met vorige waarde en wijzigingsbedrag (bijv. 3.0 → 3.2, +0.2).",
    "de": "Verbesserte Flow-Card-Tokens: Temperaturänderungs-Trigger (Umgebung, Einlass, Auslass) zeigen jetzt nur aktuelle Temperatur. COP-Effizienz-Trigger zeigt Leistungstrend mit vorherigem Wert und Änderungsbetrag (z.B. 3.0 → 3.2, +0.2).",
    "fr": "Jetons de carte de flux améliorés: Les déclencheurs de changement de température (ambiante, entrée, sortie) affichent maintenant uniquement la température actuelle. Le déclencheur d'efficacité COP affiche la tendance de performance avec la valeur précédente et le montant de changement (par ex. 3.0 → 3.2, +0.2)."
  },
  "1.3.1": {
    "en": "Fixed: Calculator flow cards (Calculate Value from Time Schedule, Get Seasonal Mode) now appear in device-specific actions alongside Calculate Value from Curve.",
    "nl": "Opgelost: Calculator flow cards (Calculate Value from Time Schedule, Get Seasonal Mode) verschijnen nu bij apparaat-specifieke acties naast Calculate Value from Curve.",
    "de": "Behoben: Rechner-Flow-Karten (Calculate Value from Time Schedule, Get Seasonal Mode) erscheinen jetzt in gerätespezifischen Aktionen neben Calculate Value from Curve.",
    "fr": "Corrigé: Les cartes de flux calculateur (Calculate Value from Time Schedule, Get Seasonal Mode) apparaissent maintenant dans les actions spécifiques à l'appareil à côté de Calculate Value from Curve."
  },
  "1.3.0": {
    "en": "Added two new flow cards: Calculate Value from Time Schedule (daily temperature programming with 24-hour time ranges) and Get Seasonal Mode (automatic heating/cooling season detection based on EN 14825 standard, Oct 1 - May 15).",
    "nl": "Twee nieuwe flow cards toegevoegd: Calculate Value from Time Schedule (dagelijkse temperatuurprogrammering met 24-uurs tijdsbereiken) en Get Seasonal Mode (automatische detectie van verwarmings-/koelseizoen op basis van EN 14825 standaard, 1 okt - 15 mei).",
    "de": "Zwei neue Flow-Karten hinzugefügt: Calculate Value from Time Schedule (tägliche Temperaturprogrammierung mit 24-Stunden-Zeitbereichen) und Get Seasonal Mode (automatische Heiz-/Kühlsaison-Erkennung basierend auf EN 14825 Standard, 1. Okt - 15. Mai).",
    "fr": "Deux nouvelles cartes de flux ajoutées: Calculate Value from Time Schedule (programmation quotidienne de température avec plages horaires 24h) et Get Seasonal Mode (détection automatique de saison chauffage/refroidissement basée sur norme EN 14825, 1er oct - 15 mai)."
  },
  "1.2.3": {
    "en": "Enhanced connection diagnostics with detailed reconnection attempt logging and health state monitoring.",
    "nl": "Verbeterde verbindingsdiagnostiek met gedetailleerde logging van herverbindingspogingen en health state monitoring.",
    "de": "Erweiterte Verbindungsdiagnostik mit detaillierter Protokollierung von Wiederverbindungsversuchen und Zustandsüberwachung.",
    "fr": "Diagnostics de connexion améliorés avec journalisation détaillée des tentatives de reconnexion et surveillance de l'état de santé."
  },
  "1.2.0": {
    "en": "Added Calculate Value from Curve flow card. Maps input values (e.g., outdoor temperature) to output values using curve definitions for weather-compensated heating curves and time-based setpoint automation. Connection stability improved with faster disconnection detection",
    "nl": "Calculate Value from Curve flow card toegevoegd. Koppelt invoerwaarden (bijv. buitentemperatuur) aan uitvoerwaarden met curve definities voor weerafhankelijke verwarmingscurves en tijdsgebaseerde setpoint automatisering. Verbindingsstabiliteit verbeterd met snellere detectie van verbroken verbinding",
    "de": "Calculate Value from Curve Flow-Karte hinzugefügt. Ordnet Eingabewerte (z.B. Außentemperatur) Ausgabewerten mit Kurvdefinitionen für wetterkompensierte Heizkurven und zeitbasierte Sollwert-Automatisierung zu. Verbesserte Verbindungsstabilität mit schnellerer Erkennung von Verbindungsabbrüchen",
    "fr": "Carte de flux Calculate Value from Curve ajoutée. Mappe les valeurs d'entrée (par ex. température extérieure) aux valeurs de sortie avec définitions de courbe pour courbes de chauffage compensées par météo et automatisation de consignes temporelles. Stabilité de connexion améliorée avec détection plus rapide des déconnexions"
  },
  "1.1.1": {
    "en": "Textual adjustments",
    "nl": "tekstuele aanpasingen",
    "de": "Textliche Anpassungen",
    "fr": "Ajustements textuels"
  },
  "1.1.0": {
    "en": "Added 6 new flow card triggers: Heating mode changed, work mode changed, water mode changed, compressor state changed, defrost state changed, and backwater state changed. Enables advanced automations based on device mode transitions and system state changes.",
    "nl": "6 nieuwe flow card triggers toegevoegd: Verwarmingsmodus gewijzigd, werkingsmodus gewijzigd, watermodus gewijzigd, compressor status gewijzigd, defrost status gewijzigd en terugwater status gewijzigd. Maakt geavanceerde automatisering op basis van apparaatmodus overgangen en systeemstatuswijzigingen mogelijk.",
    "de": "6 neue Flow-Card-Trigger hinzugefügt: Heizmodus geändert, Betriebsmodus geändert, Wassermodus geändert, Kompressorstatus geändert, Abtaustatus geändert und Rückwasserstatus geändert. Ermöglicht erweiterte Automatisierung basierend auf Gerätemodusübergängen und Systemstatusänderungen.",
    "fr": "6 nouveaux déclencheurs de carte de flux ajoutés: Mode de chauffage changé, mode de fonctionnement changé, mode d'eau changé, état du compresseur changé, état du dégivrage changé et état de l'eau de retour changé. Permet une automatisation avancée basée sur les transitions de mode d'appareil et les changements d'état du système."
  },
  "1.0.37": {
    "en": "Security update: Fixed prototype pollution vulnerability in YAML parsing (CVE-2025-64718). Updated js-yaml and related dependencies to latest secure versions.",
    "nl": "Beveiligingsupdate: Prototype pollution kwetsbaarheid in YAML-parsing opgelost (CVE-2025-64718). js-yaml en gerelateerde afhankelijkheden bijgewerkt naar nieuwste veilige versies.",
    "de": "Sicherheitsupdate: Prototype-Pollution-Anfälligkeit beim YAML-Parsen behoben (CVE-2025-64718). js-yaml und zugehörige Abhängigkeiten auf neueste sichere Versionen aktualisiert.",
    "fr": "Mise à jour de sécurité: Vulnérabilité de pollution de prototype dans l'analyse YAML corrigée (CVE-2025-64718). js-yaml et les dépendances associées mises à jour vers les dernières versions sécurisées."
  },
  "1.0.36": {
    "en": "Fixed: Device now reconnects automatically within 1 minute after temporary network issues instead of becoming stuck. Previously required manual app restart after 3+ hour outages.",
    "nl": "Opgelost: Apparaat herverbindt nu automatisch binnen 1 minuut na tijdelijke netwerkonderbrekingen in plaats van vast te lopen. Eerder vereist handmatige app-herstart na 3+ uur uitval.",
    "de": "Behoben: Gerät verbindet sich jetzt automatisch innerhalb von 1 Minute nach vorübergehenden Netzwerkproblemen statt stecken zu bleiben. Früher war manueller App-Neustart nach 3+ Stunden Ausfall erforderlich.",
    "fr": "Corrigé: L'appareil se reconnecte maintenant automatiquement dans 1 minute après les problèmes réseau temporaires au lieu de rester bloqué. Nécessitait auparavant un redémarrage manuel de l'application après 3+ heures de panne."
  },
  "1.0.35": {
    "en": "Aligned heartbeat monitoring with TCP keep-alive strategy for synergistic operation. Device now preserves COP calculation history and seasonal data across app restarts and updates. Service timers improved for stability.",
    "nl": "Hartslag-monitoring afgestemd op TCP keep-alive strategie voor synergetische werking. Apparaat bewaart nu COP berekeningsgeschiedenis en seizoensdata bij app restart en updates. Service timers verbeterd voor stabiliteit.",
    "de": "Herzschlag-Überwachung auf TCP Keep-Alive-Strategie ausgerichtet für synergistische Funktion. Gerät speichert jetzt COP-Berechnungsverlauf und Saisondaten über App-Neustart und Updates. Service-Timer für Stabilität verbessert.",
    "fr": "Surveillance des battements alignée sur la stratégie TCP keep-alive pour un fonctionnement synergique. L'appareil conserve maintenant l'historique des calculs COP et les données saisonnières lors des redémarrages et mises à jour d'application. Minuteurs de service améliorés pour la stabilité."
  },
  "1.0.30": {
    "en": "Fixed: Daily and monthly COP efficiency change flow cards now trigger correctly with proper value tokens (current, previous, and change amounts). Consolidated duplicate flow card implementations that were sending conflicting tokens. Internal improvements to logging system for better diagnostics and troubleshooting.",
    "nl": "Opgelost: Dagelijkse en maandelijkse COP efficiëntie wijzigings flow cards activeren nu correct met waarde tokens (huidiging, vorig en wijzigingsbedragen). Geconsolideerde dubbele flow card implementaties die conflicterende tokens verzonden. Interne verbeteringen aan het loggingsysteem voor betere diagnostiek en probleemoplossing.",
    "de": "Behoben: Tägliche und monatliche COP-Effizienzänderungs-Flow-Karten wurden jetzt mit korrekten Wert-Tokens ausgelöst (aktuell, vorherig und Änderungsbeträge). Konsolidierte doppelte Flow-Card-Implementierungen, die in Konflikt stehende Tokens sendeten. Interne Verbesserungen am Protokollierungssystem für bessere Diagnose und Fehlerbehebung.",
    "fr": "Corrigé: Les cartes de flux de changement d'efficacité COP quotidienne et mensuelle se déclenchent maintenant correctement avec les jetons de valeur appropriés (courant, précédent et montants de changement). Implémentations de cartes de flux dupliquées consolidées qui envoyaient des jetons en conflit. Améliorations internes du système d'enregistrement pour un meilleur diagnostic et dépannage."
  },
  "1.0.15": {
    "en": "Connection status now tracked in Insights Timeline for historical visualization of connectivity patterns.",
    "nl": "Verbindingsstatus nu bijgehouden in Insights Tijdlijn voor historische visualisatie van verbindingspatronen.",
    "de": "Verbindungsstatus wird jetzt in Insights-Zeitleiste für historische Visualisierung von Verbindungsmustern verfolgt.",
    "fr": "L'état de connexion est maintenant suivi dans la chronologie Insights pour la visualisation historique des modèles de connectivité."
  },
  "1.0.11": {
    "en": "Updated documentation references. All README files now point to language-specific PDF guides for obtaining local keys (EN, NL, DE, FR).",
    "nl": "Documentatie referenties bijgewerkt. Alle README bestanden verwijzen nu naar taalspecifieke PDF handleidingen voor het verkrijgen van lokale sleutels (EN, NL, DE, FR).",
    "de": "Dokumentationsreferenzen aktualisiert. Alle README-Dateien verweisen jetzt auf sprachspezifische PDF-Anleitungen zum Abrufen lokaler Schlüssel (EN, NL, DE, FR).",
    "fr": "Références de documentation mises à jour. Tous les fichiers README pointent maintenant vers des guides PDF spécifiques à chaque langue pour obtenir des clés locales (EN, NL, DE, FR)."
  },
  "1.0.10": {
    "en": "Fixed: Electrical measurements now show correct values. Voltage displays in V (was 1000x too high), current in A (was 1000x too high), power in W (was 10x too high), and energy in kWh (was 100x too high). All readings now match actual device values.",
    "nl": "Opgelost: Elektrische metingen tonen nu correcte waarden. Spanning weergegeven in V (was 1000x te hoog), stroom in A (was 1000x te hoog), vermogen in W (was 10x te hoog), en energie in kWh (was 100x te hoog). Alle metingen komen nu overeen met werkelijke apparaat waarden.",
    "de": "Behoben: Elektrische Messungen zeigen jetzt korrekte Werte. Spannung in V (war 1000x zu hoch), Strom in A (war 1000x zu hoch), Leistung in W (war 10x zu hoch) und Energie in kWh (war 100x zu hoch). Alle Messwerte entsprechen jetzt tatsächlichen Gerätewerten.",
    "fr": "Corrigé: Les mesures électriques affichent maintenant des valeurs correctes. Tension en V (était 1000x trop élevée), courant en A (était 1000x trop élevé), puissance en W (était 10x trop élevée) et énergie en kWh (était 100x trop élevée). Toutes les lectures correspondent maintenant aux valeurs réelles de l'appareil."
  },
  "1.0.9": {
    "en": "Connection status stays accurate when device enters sleep mode. Device now distinguishes between sleeping mode and actual network issues, avoiding unnecessary disconnect notifications.",
    "nl": "Verbindingsstatus blijft accuraat wanneer apparaat in slaapstand gaat. Apparaat onderscheidt nu tussen slaapstand en echte netwerkproblemen, vermijdt onnodige verbreek-meldingen.",
    "de": "Verbindungsstatus bleibt genau, wenn Gerät in den Ruhemodus wechselt. Gerät unterscheidet jetzt zwischen Ruhemodus und tatsächlichen Netzwerkproblemen, vermeidet unnötige Trennungsbenachrichtigungen.",
    "fr": "Le statut de connexion reste précis lorsque l'appareil entre en mode veille. L'appareil distingue maintenant le mode veille des problèmes réseau réels, évitant les notifications de déconnexion inutiles."
  },
  "1.0.8": {
    "en": "Added 10 advanced flow cards for performance monitoring and temperature automation. COP trend analysis shows efficiency patterns over time. Temperature change triggers for inlet, outlet, and ambient sensors. Efficiency monitoring for real-time, daily, and monthly COP values. Daily energy consumption threshold alerts.",
    "nl": "10 geavanceerde stroomkaarten toegevoegd voor prestatie-monitoring en temperatuur automatisering. COP trend analyse toont efficiëntie patronen over tijd. Temperatuur wijziging triggers voor inlaat, uitlaat en omgevingssensoren. Efficiëntie monitoring voor realtime, dagelijkse en maandelijkse COP waarden. Dagelijkse energie verbruik drempel waarschuwingen.",
    "de": "10 erweiterte Flow-Karten für Leistungsüberwachung und Temperaturautomatisierung hinzugefügt. COP-Trendanalyse zeigt Effizienzmuster im Zeitverlauf. Temperaturänderungs-Trigger für Einlass-, Auslass- und Umgebungssensoren. Effizienzüberwachung für Echtzeit-, Tages- und Monats-COP-Werte. Schwellenwertbenachrichtigungen für täglichen Energieverbrauch.",
    "fr": "Ajout de 10 cartes de flux avancées pour la surveillance des performances et l'automatisation de température. L'analyse de tendance COP montre les modèles d'efficacité au fil du temps. Déclencheurs de changement de température pour capteurs d'entrée, sortie et ambiante. Surveillance d'efficacité pour valeurs COP en temps réel, quotidiennes et mensuelles. Alertes de seuil de consommation énergétique quotidienne."
  },
  "1.0.7": {
    "en": "New flow cards for safety monitoring and performance tracking. Added fault detection alerts with 15 fault codes, power threshold exceeded notifications, energy milestone tracking (100 kWh intervals), and COP efficiency conditions for real-time performance checks.",
    "nl": "Nieuwe stroomkaarten voor veiligheid en prestatie-monitoring. Storing detectie toegevoegd met 15 storing codes, vermogen drempel overschreden meldingen, energie mijlpaal tracking (100 kWh intervallen), en COP efficiëntie voorwaarden voor realtime prestatie controles.",
    "de": "Neue Flow-Karten für Sicherheitsüberwachung und Leistungsverfolgung. Störungserkennung mit 15 Störungscodes, Benachrichtigungen bei Leistungsschwellen, Energiemeilenstein-Tracking (100-kWh-Intervalle) und COP-Effizienzbedingungen für Echtzeit-Leistungschecks hinzugefügt.",
    "fr": "Nouvelles cartes de flux pour la surveillance de sécurité et le suivi des performances. Détection de défauts avec 15 codes de défaut, notifications de dépassement de seuil de puissance, suivi des jalons d'énergie (intervalles de 100 kWh) et conditions d'efficacité COP pour vérifications en temps réel."
  },
  "1.0.6": {
    "en": "Fixed: Device now automatically reconnects after network issues without requiring manual force reconnect button. Connection status displays countdown to next reconnection attempt (e.g., 'disconnected [5 min, retry in 2m 30s]'). System attempts reconnection at least every 30 minutes.",
    "nl": "Opgelost: Apparaat herverbindt nu automatisch na netwerkproblemen zonder handmatige herverbinding-knop. Verbindingsstatus toont aftelling tot volgende poging (bijv. 'disconnected [5 min, retry in 2m 30s]'). Systeem probeert herverbinding minstens elke 30 minuten.",
    "de": "Behoben: Gerät verbindet sich jetzt automatisch nach Netzwerkproblemen ohne manuelle Wiederverbindungs-Taste. Verbindungsstatus zeigt Countdown bis zum nächsten Versuch (z.B. 'disconnected [5 min, retry in 2m 30s]'). System versucht Wiederverbindung mindestens alle 30 Minuten.",
    "fr": "Corrigé: L'appareil se reconnecte automatiquement après des problèmes réseau sans bouton de reconnexion manuelle. Le statut de connexion affiche le compte à rebours jusqu'à la prochaine tentative (par ex. 'disconnected [5 min, retry in 2m 30s]'). Le système tente une reconnexion au moins toutes les 30 minutes."
  },
  "1.0.5": {
    "en": "Connection auto-recovers within 15 minutes after internet outage. Notifications sent at 2, 10, and 30 minutes of downtime. Connection status shows outage duration (e.g., 'disconnected [5 min]').",
    "nl": "Verbinding herstelt automatisch binnen 15 minuten na internetuitval. Meldingen verzonden na 2, 10 en 30 minuten uitval. Verbindingsstatus toont uitval-duur (bijv. 'disconnected [5 min]').",
    "de": "Verbindung stellt sich automatisch innerhalb von 15 Minuten nach Internetausfall wieder her. Benachrichtigungen nach 2, 10 und 30 Minuten Ausfall. Verbindungsstatus zeigt Ausfallzeit (z.B. 'disconnected [5 min]').",
    "fr": "La connexion se rétablit automatiquement dans les 15 minutes après une panne Internet. Notifications envoyées après 2, 10 et 30 minutes de panne. Le statut de connexion affiche la durée de la panne (par ex. 'disconnected [5 min]')."
  },
  "1.0.4": {
    "en": "Enhanced diagnostic logging for connection troubleshooting. Device logs now include precise timestamps and disconnect source tracking to help identify connectivity issues.",
    "nl": "Verbeterde diagnostische logging voor verbindingsproblemen. Apparaat-logs bevatten nu precieze tijdstempels en tracking van verbreken-bronnen.",
    "de": "Verbesserte Diagnoseprotokollierung zur Verbindungsproblembehandlung. Geräteprotokolle enthalten nun präzise Zeitstempel und Trennungsquellen-Verfolgung.",
    "fr": "Journalisation de diagnostic améliorée pour la résolution des problèmes de connectivité. Les journaux d'appareil incluent désormais des horodatages précis et le suivi de la source de déconnexion."
  },
  "1.0.1": {
    "en": "Fixed progressive memory leak causing up to 70MB growth over 8 hours. App memory now remains stable and well-behaved. Device stability dramatically improved during extended use.",
    "nl": "Progressieve geheugenlek opgelost die tot 70 MB groei over 8 uur veroorzaakte. App-geheugen blijft nu stabiel. Apparaatstabiliteit sterk verbeterd.",
    "de": "Progressives Speicherleck behoben, das bis zu 70 MB Wachstum über 8 Stunden verursachte. App-Speicher bleibt jetzt stabil und behält sich gut.",
    "fr": "Fuite mémoire progressive corrigée causant jusqu'à 70 Mo de croissance sur 8 heures. La mémoire de l'application reste stable. Stabilité considérablement améliorée."
  },
  "1.0.0": {
    "en": "Added German and French language support. All text and timestamps now display in your Homey's language (EN/NL/DE/FR).",
    "nl": "Duitse en Franse taalondersteuning toegevoegd. Alle tekst en tijdstempels worden nu weergegeven in de taal van je Homey (EN/NL/DE/FR).",
    "de": "Deutsche und französische Sprachunterstützung hinzugefügt. Alle Texte und Zeitstempel werden jetzt in der Sprache Ihres Homey angezeigt (EN/NL/DE/FR).",
    "fr": "Prise en charge des langues allemande et française ajoutée. Tous les textes et horodatages s'affichent désormais dans la langue de votre Homey (EN/NL/DE/FR)."
  },
  "0.99.99": {
    "en": "Fixed: Device no longer remains disconnected for extended periods after network issues. Connection management now uses single reliable source, automatically reconnects within minutes instead of hours.",
    "nl": "Opgelost: Apparaat blijft niet langer langdurig losgekoppeld na netwerkproblemen. Verbindingsbeheer gebruikt nu één betrouwbare bron, herverbindt automatisch binnen minuten in plaats van uren."
  },
  "0.99.98": {
    "en": "Device now detects zombie connections during idle periods. Intelligent heartbeat monitors connection health every 5 minutes, automatically reconnects after 10 minutes without data.",
    "nl": "Apparaat detecteert nu zombie-verbindingen tijdens inactieve periodes. Intelligente heartbeat controleert verbindingsgezondheid elke 5 minuten, herverbindt automatisch na 10 minuten zonder data."
  },
  "0.99.97": {
    "en": "Updated app images showing modern home with solar panels and heat pump installation.",
    "nl": "App-afbeeldingen bijgewerkt met modern huis met zonnepanelen en warmtepomp-installatie."
  },
  "0.99.96": {
    "en": "Critical connection stability fix: Device no longer disconnects during sensor updates. All data updates now processed efficiently in batches.",
    "nl": "Kritieke verbindingsstabiliteitsfix: Apparaat verbreekt verbinding niet meer tijdens sensor-updates. Alle data-updates worden nu efficiënt in batches verwerkt."
  },
  "0.99.68": {
    "en": "Connection status now displays in your language (EN/NL). Timestamps now show correct local time instead of UTC.",
    "nl": "Verbindingsstatus wordt nu weergegeven in uw taal (EN/NL). Tijdstempels tonen nu de juiste lokale tijd in plaats van UTC."
  },
  "0.99.67": {
    "en": "Fixed connection stability issue where device would disconnect after several hours. Connection status timestamps still persist across app updates."
  },
  "0.99.66": {
    "en": "Added manual reconnect button in device settings. Use this to force immediate reconnection when device shows disconnected status."
  },
  "0.99.65": {
    "en": "Connection status timestamp now correctly persists after app updates. Status only updates when connection state actually changes."
  },
  "0.99.64": {
    "en": "Critical fix: App no longer crashes when device sends empty data packets. Added triple-layer validation for data processing."
  },
  "0.99.63": {
    "en": "Connection status shows month abbreviations (e.g., '3-Oct 14:25'). Connection timestamp now persists across app updates."
  },
  "0.99.62": {
    "en": "Device credentials can now be updated directly in settings. Device automatically reconnects when credentials change."
  },
  "0.99.61": {
    "en": "Added connection status timestamps showing when device last connected. Fixed device repair functionality. Connection status now displays as 'Connected (14:23:45)' with real-time updates."
  },
  "0.99.60": {
    "en": "Added live device credential updates without restart. Flow card management improvements with better service delegation."
  },
  "0.99.59": {
    "en": "Added protocol version selection during pairing (3.3, 3.4, 3.5). Users with connection issues can now use device repair to change protocol version. Default remains 3.3 for compatibility."
  },
  "0.99.58": {
    "en": "Critical fix: App no longer crashes on network interruptions. Fixes connection reset errors that caused app to become unresponsive. Automatic reconnection now works correctly."
  },
  "0.99.57": {
    "en": "Documentation update: Improved installation guides and technical documentation."
  },
  "0.99.56": {
    "en": "Added curve control settings for heating and hot water. Enable in device settings if needed."
  },
  "0.99.53": {
    "en": "Critical fix: Device commands now work correctly. Temperature changes and settings now properly update on the heat pump."
  },
  "0.99.49": {
    "en": "Improved connection stability and automatic reconnection timing."
  },
  "0.99.48": {
    "en": "Enhanced error handling for network connection issues."
  },
  "0.99.47": {
    "en": "Added connection status indicator showing device connection state (connected, reconnecting, error)."
  },
  "0.99.41": {
    "en": "Documentation overhaul."
  },
  "0.99.40": {
    "en": "Code optimization and improved external data handling via flow cards."
  },
  "0.99.35": {
    "en": "Fixed: Energy consumption totals now persist correctly during app updates."
  },
  "0.99.32": {
    "en": "Development environment improvements."
  },
  "0.99.31": {
    "en": "Critical fix: All device sensors now update correctly."
  },
  "0.99.30": {
    "en": "Updated dependencies and improved energy measurement accuracy."
  },
  "0.99.15": {
    "en": "Added daily energy consumption tracking with automatic midnight reset."
  },
  "0.99.13": {
    "en": "Updated measurement icons for better clarity."
  },
  "0.99.12": {
    "en": "Improved icons and temperature alert notifications."
  },
  "0.99.9": {
    "en": "Added monthly COP tracking with 30-day efficiency analysis and new flow cards."
  },
  "0.99.7": {
    "en": "Added reset button for energy counter in device settings."
  },
  "0.99.6": {
    "en": "Fixed energy calculation accuracy for small power increments."
  },
  "0.99.2": {
    "en": "Added total energy consumption calculation."
  },
  "0.98.12": {
    "en": "Added support for external temperature and flow sensors."
  },
  "0.98.10": {
    "en": "Improved documentation."
  },
  "0.98.8": {
    "en": "Fixed language support for COP trend messages."
  },
  "0.98.7": {
    "en": "Documentation update."
  },
  "0.98.6": {
    "en": "Stability improvements for rolling COP system."
  },
  "0.98.5": {
    "en": "Added daily/weekly average COP calculations with efficiency trend detection."
  },
  "0.98.2": {
    "en": "Added external data flow cards for better COP accuracy and language support."
  },
  "0.98.1": {
    "en": "Added SCOP calculation."
  },
  "0.96.3": {
    "en": "Added COP calculation."
  },
  "0.94.2": {
    "en": "Improved temperature labels in flow cards and controls."
  },
  "0.94.1": {
    "en": "Fixed device initialization errors when optional features are disabled."
  },
  "0.93.0": {
    "en": "Added option to enable/disable slider controls in device settings."
  },
  "0.92.8": {
    "en": "Improved documentation and app stability."
  },
  "0.90.0": {
    "en": "Added option to enable/disable power monitoring."
  },
  "0.80.0": {
    "en": "Added flow cards to check current device settings for advanced automation."
  },
  "0.70.0": {
    "en": "Added sensor health monitoring and diagnostic tools to troubleshoot connection issues."
  }
}
