{
  "0.99.48": {
    "en": "Critical ECONNRESET fix: Added deep socket error handler to intercept TuyAPI library internal socket errors that bypassed standard error handling. Installs error handler directly on TuyAPI's internal device object to prevent crashes from abrupt TCP connection closures. Resolves persistent ECONNRESET crash reports from v0.99.46-47."
  },
  "0.99.47": {
    "en": "Added real-time connection status monitoring: New adlar_connection_status capability displays live device connection state (connected, disconnected, reconnecting, error) with automatic updates every 5 seconds. Enhanced user visibility into Tuya connection health with distinct status indicators for different connection scenarios."
  },
  "0.99.46": {
    "en": "Production-ready release: Fixed critical crash bug with ECONNRESET errors during connection failures. Added automatic device availability status updates (unavailable during outages, available after reconnection). Implemented global error handlers for unhandled promise rejections. Enhanced connection resilience with improved error recovery and user notifications."
  },
  "0.99.41": {
    "en": "Documentation overhaul."
  },
  "0.99.40": {
    "en": "Major code optimization: Removed 565+ lines of unused service methods and fixed external data architecture. External flow and ambient temperature data now correctly use flow-card based pattern instead of faulty cross-device access. Simplified SettingsManagerService to minimal stub. All changes verified with comprehensive testing."
  },
  "0.99.35": {
    "en": "Fixed external energy total persistence during app updates: External energy consumption totals now properly survive app updates by implementing missing storage synchronization, ensuring continuity of energy tracking data across version upgrades."
  },
  "0.99.32": {
    "en": "Added TypeScript as dev dependency to ensure consistent development environment and improved code quality with explicit TypeScript tooling."
  },
  "0.99.31": {
    "en": "Critical fix for DPS sensor updates: Restored missing updateCapabilitiesFromDps method that was accidentally removed during service architecture refactoring, ensuring all Tuya device sensors now update properly."
  },
  "0.99.30": {
    "en": "Version bump with dependency updates including TypeScript 5.9.2 for enhanced development experience and improved external energy measurement capabilities."
  },
  "0.99.15": {
    "en": "Added daily external energy consumption tracking with automatic midnight reset and enhanced external measurement icons with improved visual hierarchy and prominence."
  },
  "0.99.13": {
    "en": "Updated external measurement icons with improved visual design and consistency across all measurement types for better user experience."
  },
  "0.99.12": {
    "en": "Redesigned external measurement icons with consistent visual pattern and enhanced temperature alert notifications with detailed sensor information."
  },
  "0.99.9": {
    "en": "Added monthly rolling COP capability with 30-day efficiency analysis, new flow cards for long-term monitoring, and automation support for seasonal performance tracking and maintenance scheduling."
  },
  "0.99.7": {
    "en": "Added convenient reset button for external energy total counter in device settings."
  },
  "0.99.6": {
    "en": "Fixed external energy accumulation with accurate timestamp-based calculation and enhanced precision for small power increments."
  },
  "0.99.2": {
    "en": "Calculated total energy consumption."
  },
  "0.98.12": {
    "en": "External ambient temp and flow data."
  },
  "0.98.10": {
    "en": "Introduction text in readme improved."
  },
  "0.98.8": {
    "en": "Fixed internationalization for COP trend descriptions - all efficiency trend messages now properly display in user's selected language with mobile-optimized text."
  },
  "0.98.7": {
    "en": "Update of readme"
  },
  "0.98.6": {
    "en": "App configuration updates and version maintenance for rolling COP system stability."
  },
  "0.98.5": {
    "en": "Added rolling COP system with time-series analysis: daily/weekly average COP calculations, efficiency trend detection, statistical outlier filtering, and new flow cards for advanced automation and performance monitoring."
  },
  "0.98.2": {
    "en": "Added cross-app integration with external data measurement flow cards for enhanced COP accuracy. Added COP outlier detection, full internationalization for all COP/SCOP capabilities, and mobile-optimized sensor values. Fixed device initialization issues and improved connection resilience."
  },
  "0.98.1": {
    "en": "Added SCOP calculation."
  },
  "0.96.3": {
    "en": "Added COP calculation."
  },
  "0.94.2": {
    "en": "Updated temperature-related labels for improved clarity in flow cards and device controls."
  },
  "0.94.1": {
    "en": "Fixed capability validation errors during device initialization when optional features are disabled. Enhanced error handling and consolidated capability management code."
  },
  "0.93.0": {
    "en": "Added option to enable/disable slider control capabilities for cleaner interface."
  },
  "0.92.8": {
    "en": "Improved documentation and app stability."
  },
  "0.90.0": {
    "en": "Added option to enable/disable power monitoring."
  },
  "0.80.0": {
    "en": "Added flow cards to check current device settings for advanced automation."
  },
  "0.70.0": {
    "en": "Added sensor health monitoring and diagnostic tools to troubleshoot connection issues."
  }
}