{
  "1.1.1": {
    "en": "Textual adjustments",
    "nl": "tekstuele aanpasingen",
    "de": "Textliche Anpassungen",
    "fr": "Ajustements textuels"
  },
  "1.1.0": {
    "en": "Added 6 new flow card triggers: Heating mode changed, work mode changed, water mode changed, compressor state changed, defrost state changed, and backwater state changed. Enables advanced automations based on device mode transitions and system state changes.",
    "nl": "6 nieuwe flow card triggers toegevoegd: Verwarmingsmodus gewijzigd, werkingsmodus gewijzigd, watermodus gewijzigd, compressor status gewijzigd, defrost status gewijzigd en terugwater status gewijzigd. Maakt geavanceerde automatisering op basis van apparaatmodus overgangen en systeemstatuswijzigingen mogelijk.",
    "de": "6 neue Flow-Card-Trigger hinzugefügt: Heizmodus geändert, Betriebsmodus geändert, Wassermodus geändert, Kompressorstatus geändert, Abtaustatus geändert und Rückwasserstatus geändert. Ermöglicht erweiterte Automatisierung basierend auf Gerätemodusübergängen und Systemstatusänderungen.",
    "fr": "6 nouveaux déclencheurs de carte de flux ajoutés: Mode de chauffage changé, mode de fonctionnement changé, mode d'eau changé, état du compresseur changé, état du dégivrage changé et état de l'eau de retour changé. Permet une automatisation avancée basée sur les transitions de mode d'appareil et les changements d'état du système."
  },
  "1.0.37": {
    "en": "Security update: Fixed prototype pollution vulnerability in YAML parsing (CVE-2025-64718). Updated js-yaml and related dependencies to latest secure versions.",
    "nl": "Beveiligingsupdate: Prototype pollution kwetsbaarheid in YAML-parsing opgelost (CVE-2025-64718). js-yaml en gerelateerde afhankelijkheden bijgewerkt naar nieuwste veilige versies.",
    "de": "Sicherheitsupdate: Prototype-Pollution-Anfälligkeit beim YAML-Parsen behoben (CVE-2025-64718). js-yaml und zugehörige Abhängigkeiten auf neueste sichere Versionen aktualisiert.",
    "fr": "Mise à jour de sécurité: Vulnérabilité de pollution de prototype dans l'analyse YAML corrigée (CVE-2025-64718). js-yaml et les dépendances associées mises à jour vers les dernières versions sécurisées."
  },
  "1.0.36": {
    "en": "Fixed: Device now reconnects automatically within 1 minute after temporary network issues instead of becoming stuck. Previously required manual app restart after 3+ hour outages.",
    "nl": "Opgelost: Apparaat herverbindt nu automatisch binnen 1 minuut na tijdelijke netwerkonderbrekingen in plaats van vast te lopen. Eerder vereist handmatige app-herstart na 3+ uur uitval.",
    "de": "Behoben: Gerät verbindet sich jetzt automatisch innerhalb von 1 Minute nach vorübergehenden Netzwerkproblemen statt stecken zu bleiben. Früher war manueller App-Neustart nach 3+ Stunden Ausfall erforderlich.",
    "fr": "Corrigé: L'appareil se reconnecte maintenant automatiquement dans 1 minute après les problèmes réseau temporaires au lieu de rester bloqué. Nécessitait auparavant un redémarrage manuel de l'application après 3+ heures de panne."
  },
  "1.0.35": {
    "en": "Aligned heartbeat monitoring with TCP keep-alive strategy for synergistic operation. Device now preserves COP calculation history and seasonal data across app restarts and updates. Service timers improved for stability.",
    "nl": "Hartslag-monitoring afgestemd op TCP keep-alive strategie voor synergetische werking. Apparaat bewaart nu COP berekeningsgeschiedenis en seizoensdata bij app restart en updates. Service timers verbeterd voor stabiliteit.",
    "de": "Herzschlag-Überwachung auf TCP Keep-Alive-Strategie ausgerichtet für synergistische Funktion. Gerät speichert jetzt COP-Berechnungsverlauf und Saisondaten über App-Neustart und Updates. Service-Timer für Stabilität verbessert.",
    "fr": "Surveillance des battements alignée sur la stratégie TCP keep-alive pour un fonctionnement synergique. L'appareil conserve maintenant l'historique des calculs COP et les données saisonnières lors des redémarrages et mises à jour d'application. Minuteurs de service améliorés pour la stabilité."
  },
  "1.0.30": {
    "en": "Fixed: Daily and monthly COP efficiency change flow cards now trigger correctly with proper value tokens (current, previous, and change amounts). Consolidated duplicate flow card implementations that were sending conflicting tokens. Internal improvements to logging system for better diagnostics and troubleshooting.",
    "nl": "Opgelost: Dagelijkse en maandelijkse COP efficiëntie wijzigings flow cards activeren nu correct met waarde tokens (huidiging, vorig en wijzigingsbedragen). Geconsolideerde dubbele flow card implementaties die conflicterende tokens verzonden. Interne verbeteringen aan het loggingsysteem voor betere diagnostiek en probleemoplossing.",
    "de": "Behoben: Tägliche und monatliche COP-Effizienzänderungs-Flow-Karten wurden jetzt mit korrekten Wert-Tokens ausgelöst (aktuell, vorherig und Änderungsbeträge). Konsolidierte doppelte Flow-Card-Implementierungen, die in Konflikt stehende Tokens sendeten. Interne Verbesserungen am Protokollierungssystem für bessere Diagnose und Fehlerbehebung.",
    "fr": "Corrigé: Les cartes de flux de changement d'efficacité COP quotidienne et mensuelle se déclenchent maintenant correctement avec les jetons de valeur appropriés (courant, précédent et montants de changement). Implémentations de cartes de flux dupliquées consolidées qui envoyaient des jetons en conflit. Améliorations internes du système d'enregistrement pour un meilleur diagnostic et dépannage."
  },
  "1.0.15": {
    "en": "Connection status now tracked in Insights Timeline for historical visualization of connectivity patterns.",
    "nl": "Verbindingsstatus nu bijgehouden in Insights Tijdlijn voor historische visualisatie van verbindingspatronen.",
    "de": "Verbindungsstatus wird jetzt in Insights-Zeitleiste für historische Visualisierung von Verbindungsmustern verfolgt.",
    "fr": "L'état de connexion est maintenant suivi dans la chronologie Insights pour la visualisation historique des modèles de connectivité."
  },
  "1.0.11": {
    "en": "Updated documentation references. All README files now point to language-specific PDF guides for obtaining local keys (EN, NL, DE, FR).",
    "nl": "Documentatie referenties bijgewerkt. Alle README bestanden verwijzen nu naar taalspecifieke PDF handleidingen voor het verkrijgen van lokale sleutels (EN, NL, DE, FR).",
    "de": "Dokumentationsreferenzen aktualisiert. Alle README-Dateien verweisen jetzt auf sprachspezifische PDF-Anleitungen zum Abrufen lokaler Schlüssel (EN, NL, DE, FR).",
    "fr": "Références de documentation mises à jour. Tous les fichiers README pointent maintenant vers des guides PDF spécifiques à chaque langue pour obtenir des clés locales (EN, NL, DE, FR)."
  },
  "1.0.10": {
    "en": "Fixed: Electrical measurements now show correct values. Voltage displays in V (was 1000x too high), current in A (was 1000x too high), power in W (was 10x too high), and energy in kWh (was 100x too high). All readings now match actual device values.",
    "nl": "Opgelost: Elektrische metingen tonen nu correcte waarden. Spanning weergegeven in V (was 1000x te hoog), stroom in A (was 1000x te hoog), vermogen in W (was 10x te hoog), en energie in kWh (was 100x te hoog). Alle metingen komen nu overeen met werkelijke apparaat waarden.",
    "de": "Behoben: Elektrische Messungen zeigen jetzt korrekte Werte. Spannung in V (war 1000x zu hoch), Strom in A (war 1000x zu hoch), Leistung in W (war 10x zu hoch) und Energie in kWh (war 100x zu hoch). Alle Messwerte entsprechen jetzt tatsächlichen Gerätewerten.",
    "fr": "Corrigé: Les mesures électriques affichent maintenant des valeurs correctes. Tension en V (était 1000x trop élevée), courant en A (était 1000x trop élevé), puissance en W (était 10x trop élevée) et énergie en kWh (était 100x trop élevée). Toutes les lectures correspondent maintenant aux valeurs réelles de l'appareil."
  },
  "1.0.9": {
    "en": "Connection status stays accurate when device enters sleep mode. Device now distinguishes between sleeping mode and actual network issues, avoiding unnecessary disconnect notifications.",
    "nl": "Verbindingsstatus blijft accuraat wanneer apparaat in slaapstand gaat. Apparaat onderscheidt nu tussen slaapstand en echte netwerkproblemen, vermijdt onnodige verbreek-meldingen.",
    "de": "Verbindungsstatus bleibt genau, wenn Gerät in den Ruhemodus wechselt. Gerät unterscheidet jetzt zwischen Ruhemodus und tatsächlichen Netzwerkproblemen, vermeidet unnötige Trennungsbenachrichtigungen.",
    "fr": "Le statut de connexion reste précis lorsque l'appareil entre en mode veille. L'appareil distingue maintenant le mode veille des problèmes réseau réels, évitant les notifications de déconnexion inutiles."
  },
  "1.0.8": {
    "en": "Added 10 advanced flow cards for performance monitoring and temperature automation. COP trend analysis shows efficiency patterns over time. Temperature change triggers for inlet, outlet, and ambient sensors. Efficiency monitoring for real-time, daily, and monthly COP values. Daily energy consumption threshold alerts.",
    "nl": "10 geavanceerde stroomkaarten toegevoegd voor prestatie-monitoring en temperatuur automatisering. COP trend analyse toont efficiëntie patronen over tijd. Temperatuur wijziging triggers voor inlaat, uitlaat en omgevingssensoren. Efficiëntie monitoring voor realtime, dagelijkse en maandelijkse COP waarden. Dagelijkse energie verbruik drempel waarschuwingen.",
    "de": "10 erweiterte Flow-Karten für Leistungsüberwachung und Temperaturautomatisierung hinzugefügt. COP-Trendanalyse zeigt Effizienzmuster im Zeitverlauf. Temperaturänderungs-Trigger für Einlass-, Auslass- und Umgebungssensoren. Effizienzüberwachung für Echtzeit-, Tages- und Monats-COP-Werte. Schwellenwertbenachrichtigungen für täglichen Energieverbrauch.",
    "fr": "Ajout de 10 cartes de flux avancées pour la surveillance des performances et l'automatisation de température. L'analyse de tendance COP montre les modèles d'efficacité au fil du temps. Déclencheurs de changement de température pour capteurs d'entrée, sortie et ambiante. Surveillance d'efficacité pour valeurs COP en temps réel, quotidiennes et mensuelles. Alertes de seuil de consommation énergétique quotidienne."
  },
  "1.0.7": {
    "en": "New flow cards for safety monitoring and performance tracking. Added fault detection alerts with 15 fault codes, power threshold exceeded notifications, energy milestone tracking (100 kWh intervals), and COP efficiency conditions for real-time performance checks.",
    "nl": "Nieuwe stroomkaarten voor veiligheid en prestatie-monitoring. Storing detectie toegevoegd met 15 storing codes, vermogen drempel overschreden meldingen, energie mijlpaal tracking (100 kWh intervallen), en COP efficiëntie voorwaarden voor realtime prestatie controles.",
    "de": "Neue Flow-Karten für Sicherheitsüberwachung und Leistungsverfolgung. Störungserkennung mit 15 Störungscodes, Benachrichtigungen bei Leistungsschwellen, Energiemeilenstein-Tracking (100-kWh-Intervalle) und COP-Effizienzbedingungen für Echtzeit-Leistungschecks hinzugefügt.",
    "fr": "Nouvelles cartes de flux pour la surveillance de sécurité et le suivi des performances. Détection de défauts avec 15 codes de défaut, notifications de dépassement de seuil de puissance, suivi des jalons d'énergie (intervalles de 100 kWh) et conditions d'efficacité COP pour vérifications en temps réel."
  },
  "1.0.6": {
    "en": "Fixed: Device now automatically reconnects after network issues without requiring manual force reconnect button. Connection status displays countdown to next reconnection attempt (e.g., 'disconnected [5 min, retry in 2m 30s]'). System attempts reconnection at least every 30 minutes.",
    "nl": "Opgelost: Apparaat herverbindt nu automatisch na netwerkproblemen zonder handmatige herverbinding-knop. Verbindingsstatus toont aftelling tot volgende poging (bijv. 'disconnected [5 min, retry in 2m 30s]'). Systeem probeert herverbinding minstens elke 30 minuten.",
    "de": "Behoben: Gerät verbindet sich jetzt automatisch nach Netzwerkproblemen ohne manuelle Wiederverbindungs-Taste. Verbindungsstatus zeigt Countdown bis zum nächsten Versuch (z.B. 'disconnected [5 min, retry in 2m 30s]'). System versucht Wiederverbindung mindestens alle 30 Minuten.",
    "fr": "Corrigé: L'appareil se reconnecte automatiquement après des problèmes réseau sans bouton de reconnexion manuelle. Le statut de connexion affiche le compte à rebours jusqu'à la prochaine tentative (par ex. 'disconnected [5 min, retry in 2m 30s]'). Le système tente une reconnexion au moins toutes les 30 minutes."
  },
  "1.0.5": {
    "en": "Connection auto-recovers within 15 minutes after internet outage. Notifications sent at 2, 10, and 30 minutes of downtime. Connection status shows outage duration (e.g., 'disconnected [5 min]').",
    "nl": "Verbinding herstelt automatisch binnen 15 minuten na internetuitval. Meldingen verzonden na 2, 10 en 30 minuten uitval. Verbindingsstatus toont uitval-duur (bijv. 'disconnected [5 min]').",
    "de": "Verbindung stellt sich automatisch innerhalb von 15 Minuten nach Internetausfall wieder her. Benachrichtigungen nach 2, 10 und 30 Minuten Ausfall. Verbindungsstatus zeigt Ausfallzeit (z.B. 'disconnected [5 min]').",
    "fr": "La connexion se rétablit automatiquement dans les 15 minutes après une panne Internet. Notifications envoyées après 2, 10 et 30 minutes de panne. Le statut de connexion affiche la durée de la panne (par ex. 'disconnected [5 min]')."
  },
  "1.0.4": {
    "en": "Enhanced diagnostic logging for connection troubleshooting. Device logs now include precise timestamps and disconnect source tracking to help identify connectivity issues.",
    "nl": "Verbeterde diagnostische logging voor verbindingsproblemen. Apparaat-logs bevatten nu precieze tijdstempels en tracking van verbreken-bronnen.",
    "de": "Verbesserte Diagnoseprotokollierung zur Verbindungsproblembehandlung. Geräteprotokolle enthalten nun präzise Zeitstempel und Trennungsquellen-Verfolgung.",
    "fr": "Journalisation de diagnostic améliorée pour la résolution des problèmes de connectivité. Les journaux d'appareil incluent désormais des horodatages précis et le suivi de la source de déconnexion."
  },
  "1.0.1": {
    "en": "Fixed progressive memory leak causing up to 70MB growth over 8 hours. App memory now remains stable and well-behaved. Device stability dramatically improved during extended use.",
    "nl": "Progressieve geheugenlek opgelost die tot 70 MB groei over 8 uur veroorzaakte. App-geheugen blijft nu stabiel. Apparaatstabiliteit sterk verbeterd.",
    "de": "Progressives Speicherleck behoben, das bis zu 70 MB Wachstum über 8 Stunden verursachte. App-Speicher bleibt jetzt stabil und behält sich gut.",
    "fr": "Fuite mémoire progressive corrigée causant jusqu'à 70 Mo de croissance sur 8 heures. La mémoire de l'application reste stable. Stabilité considérablement améliorée."
  },
  "1.0.0": {
    "en": "Added German and French language support. All text and timestamps now display in your Homey's language (EN/NL/DE/FR).",
    "nl": "Duitse en Franse taalondersteuning toegevoegd. Alle tekst en tijdstempels worden nu weergegeven in de taal van je Homey (EN/NL/DE/FR).",
    "de": "Deutsche und französische Sprachunterstützung hinzugefügt. Alle Texte und Zeitstempel werden jetzt in der Sprache Ihres Homey angezeigt (EN/NL/DE/FR).",
    "fr": "Prise en charge des langues allemande et française ajoutée. Tous les textes et horodatages s'affichent désormais dans la langue de votre Homey (EN/NL/DE/FR)."
  },
  "0.99.99": {
    "en": "Fixed: Device no longer remains disconnected for extended periods after network issues. Connection management now uses single reliable source, automatically reconnects within minutes instead of hours.",
    "nl": "Opgelost: Apparaat blijft niet langer langdurig losgekoppeld na netwerkproblemen. Verbindingsbeheer gebruikt nu één betrouwbare bron, herverbindt automatisch binnen minuten in plaats van uren."
  },
  "0.99.98": {
    "en": "Device now detects zombie connections during idle periods. Intelligent heartbeat monitors connection health every 5 minutes, automatically reconnects after 10 minutes without data.",
    "nl": "Apparaat detecteert nu zombie-verbindingen tijdens inactieve periodes. Intelligente heartbeat controleert verbindingsgezondheid elke 5 minuten, herverbindt automatisch na 10 minuten zonder data."
  },
  "0.99.97": {
    "en": "Updated app images showing modern home with solar panels and heat pump installation.",
    "nl": "App-afbeeldingen bijgewerkt met modern huis met zonnepanelen en warmtepomp-installatie."
  },
  "0.99.96": {
    "en": "Critical connection stability fix: Device no longer disconnects during sensor updates. All data updates now processed efficiently in batches.",
    "nl": "Kritieke verbindingsstabiliteitsfix: Apparaat verbreekt verbinding niet meer tijdens sensor-updates. Alle data-updates worden nu efficiënt in batches verwerkt."
  },
  "0.99.68": {
    "en": "Connection status now displays in your language (EN/NL). Timestamps now show correct local time instead of UTC.",
    "nl": "Verbindingsstatus wordt nu weergegeven in uw taal (EN/NL). Tijdstempels tonen nu de juiste lokale tijd in plaats van UTC."
  },
  "0.99.67": {
    "en": "Fixed connection stability issue where device would disconnect after several hours. Connection status timestamps still persist across app updates."
  },
  "0.99.66": {
    "en": "Added manual reconnect button in device settings. Use this to force immediate reconnection when device shows disconnected status."
  },
  "0.99.65": {
    "en": "Connection status timestamp now correctly persists after app updates. Status only updates when connection state actually changes."
  },
  "0.99.64": {
    "en": "Critical fix: App no longer crashes when device sends empty data packets. Added triple-layer validation for data processing."
  },
  "0.99.63": {
    "en": "Connection status shows month abbreviations (e.g., '3-Oct 14:25'). Connection timestamp now persists across app updates."
  },
  "0.99.62": {
    "en": "Device credentials can now be updated directly in settings. Device automatically reconnects when credentials change."
  },
  "0.99.61": {
    "en": "Added connection status timestamps showing when device last connected. Fixed device repair functionality. Connection status now displays as 'Connected (14:23:45)' with real-time updates."
  },
  "0.99.60": {
    "en": "Added live device credential updates without restart. Flow card management improvements with better service delegation."
  },
  "0.99.59": {
    "en": "Added protocol version selection during pairing (3.3, 3.4, 3.5). Users with connection issues can now use device repair to change protocol version. Default remains 3.3 for compatibility."
  },
  "0.99.58": {
    "en": "Critical fix: App no longer crashes on network interruptions. Fixes connection reset errors that caused app to become unresponsive. Automatic reconnection now works correctly."
  },
  "0.99.57": {
    "en": "Documentation update: Improved installation guides and technical documentation."
  },
  "0.99.56": {
    "en": "Added curve control settings for heating and hot water. Enable in device settings if needed."
  },
  "0.99.53": {
    "en": "Critical fix: Device commands now work correctly. Temperature changes and settings now properly update on the heat pump."
  },
  "0.99.49": {
    "en": "Improved connection stability and automatic reconnection timing."
  },
  "0.99.48": {
    "en": "Enhanced error handling for network connection issues."
  },
  "0.99.47": {
    "en": "Added connection status indicator showing device connection state (connected, reconnecting, error)."
  },
  "0.99.41": {
    "en": "Documentation overhaul."
  },
  "0.99.40": {
    "en": "Code optimization and improved external data handling via flow cards."
  },
  "0.99.35": {
    "en": "Fixed: Energy consumption totals now persist correctly during app updates."
  },
  "0.99.32": {
    "en": "Development environment improvements."
  },
  "0.99.31": {
    "en": "Critical fix: All device sensors now update correctly."
  },
  "0.99.30": {
    "en": "Updated dependencies and improved energy measurement accuracy."
  },
  "0.99.15": {
    "en": "Added daily energy consumption tracking with automatic midnight reset."
  },
  "0.99.13": {
    "en": "Updated measurement icons for better clarity."
  },
  "0.99.12": {
    "en": "Improved icons and temperature alert notifications."
  },
  "0.99.9": {
    "en": "Added monthly COP tracking with 30-day efficiency analysis and new flow cards."
  },
  "0.99.7": {
    "en": "Added reset button for energy counter in device settings."
  },
  "0.99.6": {
    "en": "Fixed energy calculation accuracy for small power increments."
  },
  "0.99.2": {
    "en": "Added total energy consumption calculation."
  },
  "0.98.12": {
    "en": "Added support for external temperature and flow sensors."
  },
  "0.98.10": {
    "en": "Improved documentation."
  },
  "0.98.8": {
    "en": "Fixed language support for COP trend messages."
  },
  "0.98.7": {
    "en": "Documentation update."
  },
  "0.98.6": {
    "en": "Stability improvements for rolling COP system."
  },
  "0.98.5": {
    "en": "Added daily/weekly average COP calculations with efficiency trend detection."
  },
  "0.98.2": {
    "en": "Added external data flow cards for better COP accuracy and language support."
  },
  "0.98.1": {
    "en": "Added SCOP calculation."
  },
  "0.96.3": {
    "en": "Added COP calculation."
  },
  "0.94.2": {
    "en": "Improved temperature labels in flow cards and controls."
  },
  "0.94.1": {
    "en": "Fixed device initialization errors when optional features are disabled."
  },
  "0.93.0": {
    "en": "Added option to enable/disable slider controls in device settings."
  },
  "0.92.8": {
    "en": "Improved documentation and app stability."
  },
  "0.90.0": {
    "en": "Added option to enable/disable power monitoring."
  },
  "0.80.0": {
    "en": "Added flow cards to check current device settings for advanced automation."
  },
  "0.70.0": {
    "en": "Added sensor health monitoring and diagnostic tools to troubleshoot connection issues."
  }
}
