{
  "0.99.68": {
    "en": "Connection status now displays in your language (EN/NL). Timestamps now show correct local time instead of UTC.",
    "nl": "Verbindingsstatus wordt nu weergegeven in uw taal (EN/NL). Tijdstempels tonen nu de juiste lokale tijd in plaats van UTC."
  },
  "0.99.67": {
    "en": "Fixed connection stability issue where device would disconnect after several hours. Connection status timestamps still persist across app updates."
  },
  "0.99.66": {
    "en": "Added manual reconnect button in device settings. Use this to force immediate reconnection when device shows disconnected status."
  },
  "0.99.65": {
    "en": "Connection status timestamp now correctly persists after app updates. Status only updates when connection state actually changes."
  },
  "0.99.64": {
    "en": "Critical fix: App no longer crashes when device sends empty data packets. Added triple-layer validation for data processing."
  },
  "0.99.63": {
    "en": "Connection status shows month abbreviations (e.g., '3-Oct 14:25'). Connection timestamp now persists across app updates."
  },
  "0.99.62": {
    "en": "Device credentials can now be updated directly in settings. Device automatically reconnects when credentials change."
  },
  "0.99.61": {
    "en": "Added connection status timestamps showing when device last connected. Fixed device repair functionality. Connection status now displays as 'Connected (14:23:45)' with real-time updates."
  },
  "0.99.60": {
    "en": "Added live device credential updates without restart. Flow card management improvements with better service delegation."
  },
  "0.99.59": {
    "en": "Added protocol version selection during pairing (3.3, 3.4, 3.5). Users with connection issues can now use device repair to change protocol version. Default remains 3.3 for compatibility."
  },
  "0.99.58": {
    "en": "Critical fix: App no longer crashes on network interruptions. Fixes connection reset errors that caused app to become unresponsive. Automatic reconnection now works correctly."
  },
  "0.99.57": {
    "en": "Documentation update: Improved installation guides and technical documentation."
  },
  "0.99.56": {
    "en": "Added curve control settings for heating and hot water. Enable in device settings if needed."
  },
  "0.99.53": {
    "en": "Critical fix: Device commands now work correctly. Temperature changes and settings now properly update on the heat pump."
  },
  "0.99.49": {
    "en": "Improved connection stability and automatic reconnection timing."
  },
  "0.99.48": {
    "en": "Enhanced error handling for network connection issues."
  },
  "0.99.47": {
    "en": "Added connection status indicator showing device connection state (connected, reconnecting, error)."
  },
  "0.99.41": {
    "en": "Documentation overhaul."
  },
  "0.99.40": {
    "en": "Code optimization and improved external data handling via flow cards."
  },
  "0.99.35": {
    "en": "Fixed: Energy consumption totals now persist correctly during app updates."
  },
  "0.99.32": {
    "en": "Development environment improvements."
  },
  "0.99.31": {
    "en": "Critical fix: All device sensors now update correctly."
  },
  "0.99.30": {
    "en": "Updated dependencies and improved energy measurement accuracy."
  },
  "0.99.15": {
    "en": "Added daily energy consumption tracking with automatic midnight reset."
  },
  "0.99.13": {
    "en": "Updated measurement icons for better clarity."
  },
  "0.99.12": {
    "en": "Improved icons and temperature alert notifications."
  },
  "0.99.9": {
    "en": "Added monthly COP tracking with 30-day efficiency analysis and new flow cards."
  },
  "0.99.7": {
    "en": "Added reset button for energy counter in device settings."
  },
  "0.99.6": {
    "en": "Fixed energy calculation accuracy for small power increments."
  },
  "0.99.2": {
    "en": "Added total energy consumption calculation."
  },
  "0.98.12": {
    "en": "Added support for external temperature and flow sensors."
  },
  "0.98.10": {
    "en": "Improved documentation."
  },
  "0.98.8": {
    "en": "Fixed language support for COP trend messages."
  },
  "0.98.7": {
    "en": "Documentation update."
  },
  "0.98.6": {
    "en": "Stability improvements for rolling COP system."
  },
  "0.98.5": {
    "en": "Added daily/weekly average COP calculations with efficiency trend detection."
  },
  "0.98.2": {
    "en": "Added external data flow cards for better COP accuracy and language support."
  },
  "0.98.1": {
    "en": "Added SCOP calculation."
  },
  "0.96.3": {
    "en": "Added COP calculation."
  },
  "0.94.2": {
    "en": "Improved temperature labels in flow cards and controls."
  },
  "0.94.1": {
    "en": "Fixed device initialization errors when optional features are disabled."
  },
  "0.93.0": {
    "en": "Added option to enable/disable slider controls in device settings."
  },
  "0.92.8": {
    "en": "Improved documentation and app stability."
  },
  "0.90.0": {
    "en": "Added option to enable/disable power monitoring."
  },
  "0.80.0": {
    "en": "Added flow cards to check current device settings for advanced automation."
  },
  "0.70.0": {
    "en": "Added sensor health monitoring and diagnostic tools to troubleshoot connection issues."
  }
}
